In [2]:
import pandas as pd
import numpy as np

In [4]:
mylist = ['Kalisat','Ambulu','Rambipuji','Patrang']
myseries1 = pd.Series(mylist)
print(myseries1)

0      Kalisat
1       Ambulu
2    Rambipuji
3      Patrang
dtype: object

In [5]:
mylist = [1, 3, 77, 12, 29, 30]
myseries2 = pd.Series(mylist)
print(myseries2)

0     1
1     3
2    77
3    12
4    29
5    30
dtype: int64

## DataFrame

In [8]:
mydata = [('Kalisat', 12), ('Sukorambi',36), ('Tanggul',90), ('Semboro',100)]

mydf = pd.DataFrame(mydata, columns = ['Subdistrict', 'Minutes'])

mydf

  Subdistrict  Minutes
0     Kalisat       12
1   Sukorambi       36
2     Tanggul       90
3     Semboro      100

In [10]:
mydf.dtypes

Subdistrict    object
Minutes         int64
dtype: object

### Reading in Data

In [12]:
df = pd.read_csv('openweatherdata-denpasar-1990-2020v0.1.csv')

In [13]:
df.head()

,dt_iso,timezone,city_name,lat,lon,temp,temp_min,temp_max,pressure,humidity,...,snow_3h,snow_6h,snow_12h,snow_24h,snow_today,clouds_all,weather_id,weather_main,weather_description,weather_icon
0,1/1/1990 0:00,28800,Denpasar,-8.652497,115.219117,25.82,25.82,25.82,1010.0,86,...,NaN,NaN,NaN,NaN,NaN,98,500,Rain,light rain,10d
1,1/1/1990 1:00,28800,Denpasar,-8.652497,115.219117,26.20,26.20,26.20,1011.0,84,...,NaN,NaN,NaN,NaN,NaN,91,500,Rain,light rain,10d
2,1/1/1990 2:00,28800,Denpasar,-8.652497,115.219117,26.45,26.45,26.45,1011.0,84,...,NaN,NaN,NaN,NaN,NaN,94,500,Rain,light rain,10d
3,1/1/1990 3:00,28800,Denpasar,-8.652497,115.219117,26.80,26.80,26.80,1011.0,82,...,NaN,NaN,NaN,NaN,NaN,94,500,Rain,light rain,10d
4,1/1/1990 4:00,28800,Denpasar,-8.652497,115.219117,27.04,27.04,27.04,1010.0,82,...,NaN,NaN,NaN,NaN,NaN,76,803,Clouds,broken clouds,04d